README.md
```mermaid
flowchart LR

subgraph Stockholm
S_CLIENT[Radiologist] -->|Trigger| S_PACS[Local PACS]
end

S_PACS -->|Primary series| WP

subgraph Berlin
B_CLIENT[Radiologist] -->|Trigger| B_PACS[Local PACS]
end

B_PACS -->WP

subgraph WolfPACS
WP[Primary node]
SD[Secondary node]
end

subgraph Worker pool
WP-->|Series with the same StudyUID\nwill always end up on the same worker|WA[Worker C]
WB[Worker D]
end

subgraph Worker pool
WP-->WC[Worker A]
WD[Worker B]
end
```
